[{"id": "CVE-2026-25632", "description": "EPyT-Flow is a Python package designed for the easy generation of hydraulic and water quality scenario data of water distribution networks. Prior to 0.16.1, EPyT-Flow’s REST API parses attacker-controlled JSON request bodies using a custom deserializer (my_load_from_json) that supports a type field. When type is present, the deserializer dynamically imports an attacker-specified module/class and instantiates it with attacker-supplied arguments. This allows invoking dangerous classes such as subp...", "cvss_score": 10.0, "cvss_severity": "CRITICAL", "published": "2026-02-06T21:16:18.377", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-25632"}, {"id": "CVE-2026-21531", "description": "Deserialization of untrusted data in Azure SDK allows an unauthorized attacker to execute code over a network.", "cvss_score": 9.8, "cvss_severity": "CRITICAL", "published": "2026-02-10T18:16:35.580", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-21531"}, {"id": "CVE-2026-25923", "description": "my little forum is a PHP and MySQL based internet forum that displays the messages in classical threaded view. Prior to 20260208.1, the application fails to filter the phar:// protocol in URL validation, allowing attackers to upload a malicious Phar Polyglot file (disguised as JPEG) via the image upload feature, trigger Phar deserialization through BBCode [img] tag processing, and exploit Smarty 4.1.0 POP chain to achieve arbitrary file deletion. This vulnerability is fixed in 20260208.1.", "cvss_score": 8.7, "cvss_severity": "HIGH", "published": "2026-02-09T22:16:04.460", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-25923"}, {"id": "CVE-2026-21511", "description": "Deserialization of untrusted data in Microsoft Office Outlook allows an unauthorized attacker to perform spoofing over a network.", "cvss_score": 7.5, "cvss_severity": "HIGH", "published": "2026-02-10T18:16:33.337", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-21511"}]