[{"id": "CVE-2026-25632", "description": "EPyT-Flow is a Python package designed for the easy generation of hydraulic and water quality scenario data of water distribution networks. Prior to 0.16.1, EPyT-Flow’s REST API parses attacker-controlled JSON request bodies using a custom deserializer (my_load_from_json) that supports a type field. When type is present, the deserializer dynamically imports an attacker-specified module/class and instantiates it with attacker-supplied arguments. This allows invoking dangerous classes such as subp...", "cvss_score": 10.0, "cvss_severity": "CRITICAL", "published": "2026-02-06T21:16:18.377", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-25632"}, {"id": "CVE-2020-37071", "description": "CraftCMS 3 vCard Plugin 1.0.0 contains a deserialization vulnerability that allows unauthenticated attackers to execute arbitrary PHP code through a crafted payload. Attackers can generate a malicious serialized payload that triggers remote code execution by exploiting the plugin's vCard download functionality with a specially crafted request.", "cvss_score": 9.3, "cvss_severity": "CRITICAL", "published": "2026-02-03T22:16:22.300", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2020-37071"}, {"id": "CVE-2025-70560", "description": "Boltz 2.0.0 contains an insecure deserialization vulnerability in its molecule loading functionality. The application uses Python pickle to deserialize molecule data files without validation. An attacker with the ability to place a malicious pickle file in a directory processed by boltz can achieve arbitrary code execution when the file is loaded.", "cvss_score": 8.4, "cvss_severity": "HIGH", "published": "2026-02-03T18:16:17.900", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2025-70560"}, {"id": "CVE-2026-24954", "description": "Deserialization of Untrusted Data vulnerability in magepeopleteam WpEvently mage-eventpress allows Object Injection.This issue affects WpEvently: from n/a through <= 5.0.8.", "cvss_score": 8.8, "cvss_severity": "HIGH", "published": "2026-02-03T15:16:16.280", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-24954"}, {"id": "CVE-2026-25923", "description": "my little forum is a PHP and MySQL based internet forum that displays the messages in classical threaded view. Prior to 20260208.1, the application fails to filter the phar:// protocol in URL validation, allowing attackers to upload a malicious Phar Polyglot file (disguised as JPEG) via the image upload feature, trigger Phar deserialization through BBCode [img] tag processing, and exploit Smarty 4.1.0 POP chain to achieve arbitrary file deletion. This vulnerability is fixed in 20260208.1.", "cvss_score": 8.7, "cvss_severity": "HIGH", "published": "2026-02-09T22:16:04.460", "nvd_url": "https://nvd.nist.gov/vuln/detail/CVE-2026-25923"}]